; ModuleID = './partitioned/multithreaded/orange/orange_rpc.c'
source_filename = "./partitioned/multithreaded/orange/orange_rpc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._tag = type { i32, i32, i32 }
%struct._nextrpc_datatype = type { i32, i32, i32, %struct._trailer_datatype }
%struct._trailer_datatype = type { i32, i32, i32, i16, i16 }
%struct._okay_datatype = type { i32, %struct._trailer_datatype }
%struct._request_get_a_datatype = type { i32, %struct._trailer_datatype }
%struct._response_get_a_datatype = type { double, %struct._trailer_datatype }
%union.pthread_attr_t = type { i64, [48 x i8] }

@_handle_nextrpc.inited = internal global i32 0, align 4, !dbg !0
@_handle_nextrpc.psocket = internal global i8* null, align 8, !dbg !26
@_handle_nextrpc.ssocket = internal global i8* null, align 8, !dbg !29
@.str = private unnamed_addr constant [12 x i8] c"TAG_NEXTRPC\00", section "llvm.metadata"
@.str.1 = private unnamed_addr constant [48 x i8] c"./partitioned/multithreaded/orange/orange_rpc.c\00", section "llvm.metadata"
@.str.2 = private unnamed_addr constant [9 x i8] c"TAG_OKAY\00", section "llvm.metadata"
@_handle_request_get_a.inited = internal global i32 0, align 4, !dbg !31
@_handle_request_get_a.psocket = internal global i8* null, align 8, !dbg !35
@_handle_request_get_a.ssocket = internal global i8* null, align 8, !dbg !37

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "inited", scope: !2, file: !3, line: 131, type: !34, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "_handle_nextrpc", scope: !3, file: !3, line: 118, type: !4, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !21)
!3 = !DIFile(filename: "./partitioned/multithreaded/orange/orange_rpc.c", directory: "/workspaces/build/apps/examples/example1")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "gaps_tag", file: !8, line: 28, baseType: !9)
!8 = !DIFile(filename: "/opt/closure/include/xdcomms.h", directory: "")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tag", file: !8, line: 24, size: 96, elements: !10)
!10 = !{!11, !17, !18}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "mux", scope: !9, file: !8, line: 25, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 26, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !15, line: 42, baseType: !16)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !9, file: !8, line: 26, baseType: !12, size: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "typ", scope: !9, file: !8, line: 27, baseType: !12, size: 32, offset: 64)
!19 = distinct !DICompileUnit(language: DW_LANG_C99, file: !20, producer: "clang version 10.0.1 (https://github.com/gaps-closure/llvm-project 4954dd8b02af91d5e8d4815824208b6004f667a8)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !22, globals: !25, splitDebugInlining: false, nameTableKind: None)
!20 = !DIFile(filename: "partitioned/multithreaded/orange/orange_rpc.c", directory: "/workspaces/build/apps/examples/example1")
!21 = !{}
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !{!0, !26, !29, !31, !35, !37, !39, !41, !43, !46, !48}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "psocket", scope: !2, file: !3, line: 132, type: !28, isLocal: true, isDefinition: true)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "ssocket", scope: !2, file: !3, line: 133, type: !28, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "inited", scope: !33, file: !3, line: 197, type: !34, isLocal: true, isDefinition: true)
!33 = distinct !DISubprogram(name: "_handle_request_get_a", scope: !3, file: !3, line: 184, type: !4, scopeLine: 184, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !21)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "psocket", scope: !33, file: !3, line: 198, type: !28, isLocal: true, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "ssocket", scope: !33, file: !3, line: 199, type: !28, isLocal: true, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "processed_counter", scope: !33, file: !3, line: 201, type: !34, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "restart_state", scope: !33, file: !3, line: 202, type: !34, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "last_processed_result", scope: !33, file: !3, line: 203, type: !45, isLocal: true, isDefinition: true)
!45 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "last_processed_error", scope: !33, file: !3, line: 204, type: !34, isLocal: true, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "callee_restarted", scope: !33, file: !3, line: 205, type: !34, isLocal: true, isDefinition: true)
!50 = !{i32 7, !"Dwarf Version", i32 4}
!51 = !{i32 2, !"Debug Info Version", i32 3}
!52 = !{i32 1, !"wchar_size", i32 4}
!53 = !{!"clang version 10.0.1 (https://github.com/gaps-closure/llvm-project 4954dd8b02af91d5e8d4815824208b6004f667a8)"}
!54 = distinct !DISubprogram(name: "_hal_init", scope: !3, file: !3, line: 107, type: !55, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !21)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !23, !23}
!57 = !DILocalVariable(name: "inuri", arg: 1, scope: !54, file: !3, line: 107, type: !23)
!58 = !DILocation(line: 107, column: 22, scope: !54)
!59 = !DILocalVariable(name: "outuri", arg: 2, scope: !54, file: !3, line: 107, type: !23)
!60 = !DILocation(line: 107, column: 35, scope: !54)
!61 = !DILocation(line: 109, column: 16, scope: !54)
!62 = !DILocation(line: 109, column: 5, scope: !54)
!63 = !DILocation(line: 110, column: 17, scope: !54)
!64 = !DILocation(line: 110, column: 5, scope: !54)
!65 = !DILocation(line: 111, column: 5, scope: !54)
!66 = !DILocation(line: 112, column: 5, scope: !54)
!67 = !DILocation(line: 113, column: 5, scope: !54)
!68 = !DILocation(line: 114, column: 5, scope: !54)
!69 = !DILocation(line: 116, column: 1, scope: !54)
!70 = !DILocalVariable(name: "n_tag", arg: 1, scope: !2, file: !3, line: 118, type: !6)
!71 = !DILocation(line: 118, column: 32, scope: !2)
!72 = !DILocalVariable(name: "t_tag", scope: !2, file: !3, line: 134, type: !7)
!73 = !DILocation(line: 134, column: 14, scope: !2)
!74 = !DILocalVariable(name: "o_tag", scope: !2, file: !3, line: 135, type: !7)
!75 = !DILocation(line: 135, column: 14, scope: !2)
!76 = !DILocalVariable(name: "nxt", scope: !2, file: !3, line: 139, type: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "nextrpc_datatype", file: !78, line: 39, baseType: !79)
!78 = !DIFile(filename: "./partitioned/multithreaded/autogen/codec.h", directory: "/workspaces/build/apps/examples/example1")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nextrpc_datatype", file: !78, line: 34, size: 224, elements: !80)
!80 = !{!81, !85, !86, !87}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "mux", scope: !79, file: !78, line: 35, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !83, line: 26, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !15, line: 41, baseType: !34)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !79, file: !78, line: 36, baseType: !82, size: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "typ", scope: !79, file: !78, line: 37, baseType: !82, size: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !79, file: !78, line: 38, baseType: !88, size: 128, offset: 96)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "trailer_datatype", file: !78, line: 24, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_trailer_datatype", file: !78, line: 18, size: 128, elements: !90)
!90 = !{!91, !92, !93, !94, !98}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !89, file: !78, line: 19, baseType: !12, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "rqr", scope: !89, file: !78, line: 20, baseType: !12, size: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !89, file: !78, line: 21, baseType: !12, size: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !89, file: !78, line: 22, baseType: !95, size: 16, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !13, line: 25, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !15, line: 40, baseType: !97)
!97 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !89, file: !78, line: 23, baseType: !95, size: 16, offset: 112)
!99 = !DILocation(line: 139, column: 22, scope: !2)
!100 = !DILocation(line: 139, column: 5, scope: !2)
!101 = !DILocalVariable(name: "okay", scope: !2, file: !3, line: 144, type: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "okay_datatype", file: !78, line: 51, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_okay_datatype", file: !78, line: 48, size: 160, elements: !104)
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !103, file: !78, line: 49, baseType: !82, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !103, file: !78, line: 50, baseType: !88, size: 128, offset: 32)
!107 = !DILocation(line: 144, column: 19, scope: !2)
!108 = !DILocation(line: 144, column: 5, scope: !2)
!109 = !DILocation(line: 150, column: 5, scope: !2)
!110 = !DILocation(line: 158, column: 10, scope: !111)
!111 = distinct !DILexicalBlock(scope: !2, file: !3, line: 158, column: 9)
!112 = !DILocation(line: 158, column: 9, scope: !2)
!113 = !DILocation(line: 159, column: 16, scope: !114)
!114 = distinct !DILexicalBlock(scope: !111, file: !3, line: 158, column: 18)
!115 = !DILocation(line: 160, column: 19, scope: !114)
!116 = !DILocation(line: 160, column: 17, scope: !114)
!117 = !DILocation(line: 161, column: 19, scope: !114)
!118 = !DILocation(line: 161, column: 17, scope: !114)
!119 = !DILocation(line: 162, column: 9, scope: !114)
!120 = !DILocation(line: 163, column: 5, scope: !114)
!121 = !DILocation(line: 174, column: 23, scope: !2)
!122 = !DILocation(line: 174, column: 32, scope: !2)
!123 = !DILocation(line: 174, column: 5, scope: !2)
!124 = !DILocation(line: 175, column: 5, scope: !2)
!125 = !DILocation(line: 176, column: 10, scope: !2)
!126 = !DILocation(line: 176, column: 12, scope: !2)
!127 = !DILocation(line: 177, column: 19, scope: !2)
!128 = !DILocation(line: 177, column: 28, scope: !2)
!129 = !DILocation(line: 177, column: 5, scope: !2)
!130 = !DILocation(line: 179, column: 22, scope: !2)
!131 = !DILocation(line: 179, column: 5, scope: !2)
!132 = !DILocation(line: 179, column: 12, scope: !2)
!133 = !DILocation(line: 179, column: 16, scope: !2)
!134 = !DILocation(line: 180, column: 22, scope: !2)
!135 = !DILocation(line: 180, column: 5, scope: !2)
!136 = !DILocation(line: 180, column: 12, scope: !2)
!137 = !DILocation(line: 180, column: 16, scope: !2)
!138 = !DILocation(line: 181, column: 22, scope: !2)
!139 = !DILocation(line: 181, column: 5, scope: !2)
!140 = !DILocation(line: 181, column: 12, scope: !2)
!141 = !DILocation(line: 181, column: 16, scope: !2)
!142 = !DILocation(line: 182, column: 1, scope: !2)
!143 = !DILocalVariable(name: "tag", arg: 1, scope: !33, file: !3, line: 184, type: !6)
!144 = !DILocation(line: 184, column: 38, scope: !33)
!145 = !DILocalVariable(name: "t_tag", scope: !33, file: !3, line: 206, type: !7)
!146 = !DILocation(line: 206, column: 14, scope: !33)
!147 = !DILocalVariable(name: "o_tag", scope: !33, file: !3, line: 207, type: !7)
!148 = !DILocation(line: 207, column: 14, scope: !33)
!149 = !DILocalVariable(name: "req_get_a", scope: !33, file: !3, line: 211, type: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_get_a_datatype", file: !78, line: 61, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_request_get_a_datatype", file: !78, line: 58, size: 160, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !151, file: !78, line: 59, baseType: !82, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !151, file: !78, line: 60, baseType: !88, size: 128, offset: 32)
!155 = !DILocation(line: 211, column: 28, scope: !33)
!156 = !DILocation(line: 211, column: 5, scope: !33)
!157 = !DILocation(line: 217, column: 5, scope: !33)
!158 = !DILocalVariable(name: "res_get_a", scope: !33, file: !3, line: 221, type: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "response_get_a_datatype", file: !78, line: 71, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_response_get_a_datatype", file: !78, line: 68, size: 192, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ret", scope: !160, file: !78, line: 69, baseType: !45, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !160, file: !78, line: 70, baseType: !88, size: 128, offset: 64)
!164 = !DILocation(line: 221, column: 29, scope: !33)
!165 = !DILocation(line: 221, column: 5, scope: !33)
!166 = !DILocation(line: 227, column: 5, scope: !33)
!167 = !DILocation(line: 235, column: 10, scope: !168)
!168 = distinct !DILexicalBlock(scope: !33, file: !3, line: 235, column: 9)
!169 = !DILocation(line: 235, column: 9, scope: !33)
!170 = !DILocation(line: 236, column: 16, scope: !171)
!171 = distinct !DILexicalBlock(scope: !168, file: !3, line: 235, column: 18)
!172 = !DILocation(line: 238, column: 26, scope: !171)
!173 = !DILocation(line: 240, column: 19, scope: !171)
!174 = !DILocation(line: 240, column: 17, scope: !171)
!175 = !DILocation(line: 241, column: 19, scope: !171)
!176 = !DILocation(line: 241, column: 17, scope: !171)
!177 = !DILocation(line: 242, column: 9, scope: !171)
!178 = !DILocation(line: 243, column: 5, scope: !171)
!179 = !DILocation(line: 248, column: 23, scope: !33)
!180 = !DILocation(line: 248, column: 32, scope: !33)
!181 = !DILocation(line: 248, column: 5, scope: !33)
!182 = !DILocation(line: 250, column: 21, scope: !33)
!183 = !DILocation(line: 250, column: 15, scope: !33)
!184 = !DILocation(line: 250, column: 19, scope: !33)
!185 = !DILocalVariable(name: "reqId", scope: !33, file: !3, line: 261, type: !34)
!186 = !DILocation(line: 261, column: 9, scope: !33)
!187 = !DILocation(line: 261, column: 27, scope: !33)
!188 = !DILocation(line: 261, column: 35, scope: !33)
!189 = !DILocation(line: 262, column: 5, scope: !190)
!190 = distinct !DILexicalBlock(scope: !33, file: !3, line: 262, column: 5)
!191 = !DILocation(line: 262, column: 13, scope: !190)
!192 = !DILocation(line: 262, column: 11, scope: !190)
!193 = !DILocation(line: 262, column: 5, scope: !33)
!194 = !DILocalVariable(name: "error", scope: !195, file: !3, line: 263, type: !196)
!195 = distinct !DILexicalBlock(scope: !190, file: !3, line: 262, column: 31)
!196 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!197 = !DILocation(line: 263, column: 8, scope: !195)
!198 = !DILocation(line: 264, column: 23, scope: !195)
!199 = !DILocation(line: 264, column: 21, scope: !195)
!200 = !DILocation(line: 265, column: 6, scope: !201)
!201 = distinct !DILexicalBlock(scope: !195, file: !3, line: 265, column: 6)
!202 = !DILocation(line: 265, column: 15, scope: !201)
!203 = !DILocation(line: 265, column: 12, scope: !201)
!204 = !DILocation(line: 265, column: 6, scope: !195)
!205 = !DILocation(line: 265, column: 53, scope: !201)
!206 = !DILocation(line: 265, column: 30, scope: !201)
!207 = !DILocation(line: 266, column: 27, scope: !195)
!208 = !DILocation(line: 266, column: 25, scope: !195)
!209 = !DILocation(line: 267, column: 26, scope: !195)
!210 = !DILocation(line: 267, column: 24, scope: !195)
!211 = !DILocation(line: 268, column: 17, scope: !195)
!212 = !DILocation(line: 269, column: 26, scope: !195)
!213 = !DILocation(line: 270, column: 27, scope: !195)
!214 = !DILocation(line: 270, column: 45, scope: !195)
!215 = !DILocation(line: 270, column: 52, scope: !195)
!216 = !DILocation(line: 270, column: 73, scope: !195)
!217 = !DILocation(line: 270, column: 50, scope: !195)
!218 = !DILocation(line: 270, column: 80, scope: !195)
!219 = !DILocation(line: 270, column: 78, scope: !195)
!220 = !DILocation(line: 270, column: 13, scope: !195)
!221 = !DILocation(line: 270, column: 21, scope: !195)
!222 = !DILocation(line: 270, column: 25, scope: !195)
!223 = !DILocation(line: 271, column: 19, scope: !195)
!224 = !DILocation(line: 271, column: 13, scope: !195)
!225 = !DILocation(line: 271, column: 17, scope: !195)
!226 = !DILocation(line: 272, column: 17, scope: !195)
!227 = !DILocation(line: 272, column: 26, scope: !195)
!228 = !DILocation(line: 272, column: 3, scope: !195)
!229 = !DILocation(line: 273, column: 2, scope: !195)
!230 = !DILocation(line: 274, column: 10, scope: !231)
