; ModuleID = './partitioned/multithreaded/orange/orange_rpc.c'
source_filename = "./partitioned/multithreaded/orange/orange_rpc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._tag = type { i32, i32, i32 }
%struct._nextrpc_datatype = type { i32, i32, i32, %struct._trailer_datatype }
%struct._trailer_datatype = type { i32, i32, i32, i16, i16 }
%struct._okay_datatype = type { i32, %struct._trailer_datatype }
%struct._request_get_a_datatype = type { i32, %struct._trailer_datatype }
%struct._response_get_a_datatype = type { double, %struct._trailer_datatype }
%union.pthread_attr_t = type { i64, [48 x i8] }

@_handle_nextrpc.inited = internal global i32 0, align 4, !dbg !0
@_handle_nextrpc.psocket = internal global i8* null, align 8, !dbg !26
@_handle_nextrpc.ssocket = internal global i8* null, align 8, !dbg !29
@.str = private unnamed_addr constant [12 x i8] c"TAG_NEXTRPC\00", section "llvm.metadata"
@.str.1 = private unnamed_addr constant [48 x i8] c"./partitioned/multithreaded/orange/orange_rpc.c\00", section "llvm.metadata"
@.str.2 = private unnamed_addr constant [9 x i8] c"TAG_OKAY\00", section "llvm.metadata"
@_handle_request_get_a.inited = internal global i32 0, align 4, !dbg !31
@_handle_request_get_a.psocket = internal global i8* null, align 8, !dbg !35
@_handle_request_get_a.ssocket = internal global i8* null, align 8, !dbg !37

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "inited", scope: !2, file: !3, line: 130, type: !34, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "_handle_nextrpc", scope: !3, file: !3, line: 117, type: !4, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !21)
!3 = !DIFile(filename: "./partitioned/multithreaded/orange/orange_rpc.c", directory: "/workspaces/build/apps/examples/example1")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "gaps_tag", file: !8, line: 28, baseType: !9)
!8 = !DIFile(filename: "/opt/closure/include/xdcomms.h", directory: "")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tag", file: !8, line: 24, size: 96, elements: !10)
!10 = !{!11, !17, !18}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "mux", scope: !9, file: !8, line: 25, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 26, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !15, line: 42, baseType: !16)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !9, file: !8, line: 26, baseType: !12, size: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "typ", scope: !9, file: !8, line: 27, baseType: !12, size: 32, offset: 64)
!19 = distinct !DICompileUnit(language: DW_LANG_C99, file: !20, producer: "clang version 10.0.1 (https://github.com/gaps-closure/llvm-project 4954dd8b02af91d5e8d4815824208b6004f667a8)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !22, globals: !25, splitDebugInlining: false, nameTableKind: None)
!20 = !DIFile(filename: "partitioned/multithreaded/orange/orange_rpc.c", directory: "/workspaces/build/apps/examples/example1")
!21 = !{}
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !{!0, !26, !29, !31, !35, !37, !39, !41, !43, !46, !48, !50}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "psocket", scope: !2, file: !3, line: 131, type: !28, isLocal: true, isDefinition: true)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "ssocket", scope: !2, file: !3, line: 132, type: !28, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "inited", scope: !33, file: !3, line: 196, type: !34, isLocal: true, isDefinition: true)
!33 = distinct !DISubprogram(name: "_handle_request_get_a", scope: !3, file: !3, line: 183, type: !4, scopeLine: 183, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !21)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "psocket", scope: !33, file: !3, line: 197, type: !28, isLocal: true, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "ssocket", scope: !33, file: !3, line: 198, type: !28, isLocal: true, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "processed_counter", scope: !33, file: !3, line: 199, type: !34, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "restart_state", scope: !33, file: !3, line: 200, type: !34, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "last_processed_result", scope: !33, file: !3, line: 201, type: !45, isLocal: true, isDefinition: true)
!45 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "last_processed_error", scope: !33, file: !3, line: 202, type: !34, isLocal: true, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "callee_restarted", scope: !33, file: !3, line: 203, type: !34, isLocal: true, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "caller_restarted_get_a", scope: !19, file: !52, line: 55, type: !53, isLocal: false, isDefinition: true)
!52 = !DIFile(filename: "./partitioned/multithreaded/orange/orange_rpc.h", directory: "/workspaces/build/apps/examples/example1")
!53 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!54 = !{i32 7, !"Dwarf Version", i32 4}
!55 = !{i32 2, !"Debug Info Version", i32 3}
!56 = !{i32 1, !"wchar_size", i32 4}
!57 = !{!"clang version 10.0.1 (https://github.com/gaps-closure/llvm-project 4954dd8b02af91d5e8d4815824208b6004f667a8)"}
!58 = distinct !DISubprogram(name: "_hal_init", scope: !3, file: !3, line: 106, type: !59, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !21)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !23, !23}
!61 = !DILocalVariable(name: "inuri", arg: 1, scope: !58, file: !3, line: 106, type: !23)
!62 = !DILocation(line: 106, column: 22, scope: !58)
!63 = !DILocalVariable(name: "outuri", arg: 2, scope: !58, file: !3, line: 106, type: !23)
!64 = !DILocation(line: 106, column: 35, scope: !58)
!65 = !DILocation(line: 108, column: 16, scope: !58)
!66 = !DILocation(line: 108, column: 5, scope: !58)
!67 = !DILocation(line: 109, column: 17, scope: !58)
!68 = !DILocation(line: 109, column: 5, scope: !58)
!69 = !DILocation(line: 110, column: 5, scope: !58)
!70 = !DILocation(line: 111, column: 5, scope: !58)
!71 = !DILocation(line: 112, column: 5, scope: !58)
!72 = !DILocation(line: 113, column: 5, scope: !58)
!73 = !DILocation(line: 115, column: 1, scope: !58)
!74 = !DILocalVariable(name: "n_tag", arg: 1, scope: !2, file: !3, line: 117, type: !6)
!75 = !DILocation(line: 117, column: 32, scope: !2)
!76 = !DILocalVariable(name: "t_tag", scope: !2, file: !3, line: 133, type: !7)
!77 = !DILocation(line: 133, column: 14, scope: !2)
!78 = !DILocalVariable(name: "o_tag", scope: !2, file: !3, line: 134, type: !7)
!79 = !DILocation(line: 134, column: 14, scope: !2)
!80 = !DILocalVariable(name: "nxt", scope: !2, file: !3, line: 138, type: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "nextrpc_datatype", file: !82, line: 39, baseType: !83)
!82 = !DIFile(filename: "./partitioned/multithreaded/autogen/codec.h", directory: "/workspaces/build/apps/examples/example1")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nextrpc_datatype", file: !82, line: 34, size: 224, elements: !84)
!84 = !{!85, !89, !90, !91}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mux", scope: !83, file: !82, line: 35, baseType: !86, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !87, line: 26, baseType: !88)
!87 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !15, line: 41, baseType: !34)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !83, file: !82, line: 36, baseType: !86, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "typ", scope: !83, file: !82, line: 37, baseType: !86, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !83, file: !82, line: 38, baseType: !92, size: 128, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "trailer_datatype", file: !82, line: 24, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_trailer_datatype", file: !82, line: 18, size: 128, elements: !94)
!94 = !{!95, !96, !97, !98, !102}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !93, file: !82, line: 19, baseType: !12, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "rqr", scope: !93, file: !82, line: 20, baseType: !12, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !93, file: !82, line: 21, baseType: !12, size: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !93, file: !82, line: 22, baseType: !99, size: 16, offset: 96)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !13, line: 25, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !15, line: 40, baseType: !101)
!101 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !93, file: !82, line: 23, baseType: !99, size: 16, offset: 112)
!103 = !DILocation(line: 138, column: 22, scope: !2)
!104 = !DILocation(line: 138, column: 5, scope: !2)
!105 = !DILocalVariable(name: "okay", scope: !2, file: !3, line: 143, type: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "okay_datatype", file: !82, line: 51, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_okay_datatype", file: !82, line: 48, size: 160, elements: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !107, file: !82, line: 49, baseType: !86, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !107, file: !82, line: 50, baseType: !92, size: 128, offset: 32)
!111 = !DILocation(line: 143, column: 19, scope: !2)
!112 = !DILocation(line: 143, column: 5, scope: !2)
!113 = !DILocation(line: 149, column: 5, scope: !2)
!114 = !DILocation(line: 157, column: 10, scope: !115)
!115 = distinct !DILexicalBlock(scope: !2, file: !3, line: 157, column: 9)
!116 = !DILocation(line: 157, column: 9, scope: !2)
!117 = !DILocation(line: 158, column: 16, scope: !118)
!118 = distinct !DILexicalBlock(scope: !115, file: !3, line: 157, column: 18)
!119 = !DILocation(line: 159, column: 19, scope: !118)
!120 = !DILocation(line: 159, column: 17, scope: !118)
!121 = !DILocation(line: 160, column: 19, scope: !118)
!122 = !DILocation(line: 160, column: 17, scope: !118)
!123 = !DILocation(line: 161, column: 9, scope: !118)
!124 = !DILocation(line: 162, column: 5, scope: !118)
!125 = !DILocation(line: 173, column: 23, scope: !2)
!126 = !DILocation(line: 173, column: 32, scope: !2)
!127 = !DILocation(line: 173, column: 5, scope: !2)
!128 = !DILocation(line: 174, column: 5, scope: !2)
!129 = !DILocation(line: 175, column: 10, scope: !2)
!130 = !DILocation(line: 175, column: 12, scope: !2)
!131 = !DILocation(line: 176, column: 19, scope: !2)
!132 = !DILocation(line: 176, column: 28, scope: !2)
!133 = !DILocation(line: 176, column: 5, scope: !2)
!134 = !DILocation(line: 178, column: 22, scope: !2)
!135 = !DILocation(line: 178, column: 5, scope: !2)
!136 = !DILocation(line: 178, column: 12, scope: !2)
!137 = !DILocation(line: 178, column: 16, scope: !2)
!138 = !DILocation(line: 179, column: 22, scope: !2)
!139 = !DILocation(line: 179, column: 5, scope: !2)
!140 = !DILocation(line: 179, column: 12, scope: !2)
!141 = !DILocation(line: 179, column: 16, scope: !2)
!142 = !DILocation(line: 180, column: 22, scope: !2)
!143 = !DILocation(line: 180, column: 5, scope: !2)
!144 = !DILocation(line: 180, column: 12, scope: !2)
!145 = !DILocation(line: 180, column: 16, scope: !2)
!146 = !DILocation(line: 181, column: 1, scope: !2)
!147 = !DILocalVariable(name: "tag", arg: 1, scope: !33, file: !3, line: 183, type: !6)
!148 = !DILocation(line: 183, column: 38, scope: !33)
!149 = !DILocalVariable(name: "t_tag", scope: !33, file: !3, line: 204, type: !7)
!150 = !DILocation(line: 204, column: 14, scope: !33)
!151 = !DILocalVariable(name: "o_tag", scope: !33, file: !3, line: 205, type: !7)
!152 = !DILocation(line: 205, column: 14, scope: !33)
!153 = !DILocalVariable(name: "req_get_a", scope: !33, file: !3, line: 209, type: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_get_a_datatype", file: !82, line: 61, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_request_get_a_datatype", file: !82, line: 58, size: 160, elements: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !155, file: !82, line: 59, baseType: !86, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !155, file: !82, line: 60, baseType: !92, size: 128, offset: 32)
!159 = !DILocation(line: 209, column: 28, scope: !33)
!160 = !DILocation(line: 209, column: 5, scope: !33)
!161 = !DILocation(line: 215, column: 5, scope: !33)
!162 = !DILocalVariable(name: "res_get_a", scope: !33, file: !3, line: 219, type: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "response_get_a_datatype", file: !82, line: 71, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_response_get_a_datatype", file: !82, line: 68, size: 192, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ret", scope: !164, file: !82, line: 69, baseType: !45, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !164, file: !82, line: 70, baseType: !92, size: 128, offset: 64)
!168 = !DILocation(line: 219, column: 29, scope: !33)
!169 = !DILocation(line: 219, column: 5, scope: !33)
!170 = !DILocation(line: 225, column: 5, scope: !33)
!171 = !DILocation(line: 233, column: 10, scope: !172)
!172 = distinct !DILexicalBlock(scope: !33, file: !3, line: 233, column: 9)
!173 = !DILocation(line: 233, column: 9, scope: !33)
!174 = !DILocation(line: 234, column: 16, scope: !175)
!175 = distinct !DILexicalBlock(scope: !172, file: !3, line: 233, column: 18)
!176 = !DILocation(line: 235, column: 27, scope: !175)
!177 = !DILocation(line: 236, column: 19, scope: !175)
!178 = !DILocation(line: 236, column: 17, scope: !175)
!179 = !DILocation(line: 237, column: 19, scope: !175)
!180 = !DILocation(line: 237, column: 17, scope: !175)
!181 = !DILocation(line: 238, column: 9, scope: !175)
!182 = !DILocation(line: 239, column: 5, scope: !175)
!183 = !DILocation(line: 244, column: 23, scope: !33)
!184 = !DILocation(line: 244, column: 32, scope: !33)
!185 = !DILocation(line: 244, column: 5, scope: !33)
!186 = !DILocation(line: 246, column: 21, scope: !33)
!187 = !DILocation(line: 246, column: 15, scope: !33)
!188 = !DILocation(line: 246, column: 19, scope: !33)
!189 = !DILocalVariable(name: "reqId", scope: !33, file: !3, line: 256, type: !34)
!190 = !DILocation(line: 256, column: 9, scope: !33)
!191 = !DILocation(line: 256, column: 27, scope: !33)
!192 = !DILocation(line: 256, column: 35, scope: !33)
!193 = !DILocation(line: 257, column: 8, scope: !194)
!194 = distinct !DILexicalBlock(scope: !33, file: !3, line: 257, column: 8)
!195 = !DILocation(line: 257, column: 16, scope: !194)
!196 = !DILocation(line: 257, column: 14, scope: !194)
!197 = !DILocation(line: 257, column: 8, scope: !33)
!198 = !DILocalVariable(name: "error", scope: !199, file: !3, line: 258, type: !53)
!199 = distinct !DILexicalBlock(scope: !194, file: !3, line: 257, column: 34)
!200 = !DILocation(line: 258, column: 14, scope: !199)
!201 = !DILocation(line: 259, column: 29, scope: !199)
!202 = !DILocation(line: 259, column: 27, scope: !199)
!203 = !DILocation(line: 260, column: 12, scope: !204)
!204 = distinct !DILexicalBlock(scope: !199, file: !3, line: 260, column: 12)
!205 = !DILocation(line: 260, column: 21, scope: !204)
!206 = !DILocation(line: 260, column: 18, scope: !204)
!207 = !DILocation(line: 260, column: 12, scope: !199)
!208 = !DILocation(line: 260, column: 59, scope: !204)
!209 = !DILocation(line: 260, column: 36, scope: !204)
!210 = !DILocation(line: 261, column: 33, scope: !199)
!211 = !DILocation(line: 261, column: 31, scope: !199)
!212 = !DILocation(line: 262, column: 32, scope: !199)
!213 = !DILocation(line: 262, column: 30, scope: !199)
!214 = !DILocation(line: 263, column: 23, scope: !199)
!215 = !DILocation(line: 264, column: 32, scope: !199)
!216 = !DILocation(line: 265, column: 33, scope: !199)
!217 = !DILocation(line: 265, column: 51, scope: !199)
!218 = !DILocation(line: 265, column: 58, scope: !199)
!219 = !DILocation(line: 265, column: 79, scope: !199)
!220 = !DILocation(line: 265, column: 56, scope: !199)
!221 = !DILocation(line: 265, column: 86, scope: !199)
!222 = !DILocation(line: 265, column: 84, scope: !199)
!223 = !DILocation(line: 265, column: 19, scope: !199)
!224 = !DILocation(line: 265, column: 27, scope: !199)
!225 = !DILocation(line: 265, column: 31, scope: !199)
!226 = !DILocation(line: 266, column: 25, scope: !199)
!227 = !DILocation(line: 266, column: 19, scope: !199)
!228 = !DILocation(line: 266, column: 23, scope: !199)
!229 = !DILocation(line: 267, column: 23, scope: !199)
!230 = !DILocation(line: 267, column: 32, scope: !199)
!231 = !DILocation(line: 267, column: 9, scope: !199)
!232 = !DILocation(line: 268, column: 5, scope: !199)
!233 = !DILocation(line: 269, column: 13, scope: !234)
!234 = distinct !DILexicalBlock(scope: !194, file: !3, line: 269, column: 13)
