; ModuleID = './partitioned/multithreaded/purple/purple_rpc.c'
source_filename = "./partitioned/multithreaded/purple/purple_rpc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._tag = type { i32, i32, i32 }
%struct._nextrpc_datatype = type { i32, i32, i32, %struct._trailer_datatype }
%struct._trailer_datatype = type { i32, i32, i32, i16, i16 }
%struct._okay_datatype = type { i32, %struct._trailer_datatype }
%struct._request_get_ewma_datatype = type { double, %struct._trailer_datatype }
%struct._response_get_ewma_datatype = type { double, %struct._trailer_datatype }
%union.pthread_attr_t = type { i64, [48 x i8] }

@_handle_nextrpc.inited = internal global i32 0, align 4, !dbg !0
@_handle_nextrpc.psocket = internal global i8* null, align 8, !dbg !26
@_handle_nextrpc.ssocket = internal global i8* null, align 8, !dbg !29
@.str = private unnamed_addr constant [12 x i8] c"TAG_NEXTRPC\00", section "llvm.metadata"
@.str.1 = private unnamed_addr constant [48 x i8] c"./partitioned/multithreaded/purple/purple_rpc.c\00", section "llvm.metadata"
@.str.2 = private unnamed_addr constant [9 x i8] c"TAG_OKAY\00", section "llvm.metadata"
@_handle_request_get_ewma.inited = internal global i32 0, align 4, !dbg !31
@_handle_request_get_ewma.psocket = internal global i8* null, align 8, !dbg !35
@_handle_request_get_ewma.ssocket = internal global i8* null, align 8, !dbg !37

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "inited", scope: !2, file: !3, line: 161, type: !34, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "_handle_nextrpc", scope: !3, file: !3, line: 148, type: !4, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !21)
!3 = !DIFile(filename: "./partitioned/multithreaded/purple/purple_rpc.c", directory: "/workspaces/build/apps/examples/example2")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "gaps_tag", file: !8, line: 28, baseType: !9)
!8 = !DIFile(filename: "/opt/closure/include/xdcomms.h", directory: "")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tag", file: !8, line: 24, size: 96, elements: !10)
!10 = !{!11, !17, !18}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "mux", scope: !9, file: !8, line: 25, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 26, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !15, line: 42, baseType: !16)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !9, file: !8, line: 26, baseType: !12, size: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "typ", scope: !9, file: !8, line: 27, baseType: !12, size: 32, offset: 64)
!19 = distinct !DICompileUnit(language: DW_LANG_C99, file: !20, producer: "clang version 10.0.1 (https://github.com/gaps-closure/llvm-project 4954dd8b02af91d5e8d4815824208b6004f667a8)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !22, globals: !25, splitDebugInlining: false, nameTableKind: None)
!20 = !DIFile(filename: "partitioned/multithreaded/purple/purple_rpc.c", directory: "/workspaces/build/apps/examples/example2")
!21 = !{}
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !{!0, !26, !29, !31, !35, !37, !39, !41, !44}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "psocket", scope: !2, file: !3, line: 162, type: !28, isLocal: true, isDefinition: true)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "ssocket", scope: !2, file: !3, line: 163, type: !28, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "inited", scope: !33, file: !3, line: 230, type: !34, isLocal: true, isDefinition: true)
!33 = distinct !DISubprogram(name: "_handle_request_get_ewma", scope: !3, file: !3, line: 214, type: !4, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !21)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "psocket", scope: !33, file: !3, line: 231, type: !28, isLocal: true, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "ssocket", scope: !33, file: !3, line: 232, type: !28, isLocal: true, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "processed_counter", scope: !33, file: !3, line: 233, type: !34, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "last_processed_result", scope: !33, file: !3, line: 234, type: !43, isLocal: true, isDefinition: true)
!43 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "last_processed_error", scope: !33, file: !3, line: 235, type: !34, isLocal: true, isDefinition: true)
!46 = !{i32 7, !"Dwarf Version", i32 4}
!47 = !{i32 2, !"Debug Info Version", i32 3}
!48 = !{i32 1, !"wchar_size", i32 4}
!49 = !{!"clang version 10.0.1 (https://github.com/gaps-closure/llvm-project 4954dd8b02af91d5e8d4815824208b6004f667a8)"}
!50 = distinct !DISubprogram(name: "_hal_init", scope: !3, file: !3, line: 137, type: !51, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !21)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !23, !23}
!53 = !DILocalVariable(name: "inuri", arg: 1, scope: !50, file: !3, line: 137, type: !23)
!54 = !DILocation(line: 137, column: 22, scope: !50)
!55 = !DILocalVariable(name: "outuri", arg: 2, scope: !50, file: !3, line: 137, type: !23)
!56 = !DILocation(line: 137, column: 35, scope: !50)
!57 = !DILocation(line: 139, column: 16, scope: !50)
!58 = !DILocation(line: 139, column: 5, scope: !50)
!59 = !DILocation(line: 140, column: 17, scope: !50)
!60 = !DILocation(line: 140, column: 5, scope: !50)
!61 = !DILocation(line: 141, column: 5, scope: !50)
!62 = !DILocation(line: 142, column: 5, scope: !50)
!63 = !DILocation(line: 143, column: 5, scope: !50)
!64 = !DILocation(line: 144, column: 5, scope: !50)
!65 = !DILocation(line: 146, column: 1, scope: !50)
!66 = !DILocalVariable(name: "n_tag", arg: 1, scope: !2, file: !3, line: 148, type: !6)
!67 = !DILocation(line: 148, column: 32, scope: !2)
!68 = !DILocalVariable(name: "t_tag", scope: !2, file: !3, line: 164, type: !7)
!69 = !DILocation(line: 164, column: 14, scope: !2)
!70 = !DILocalVariable(name: "o_tag", scope: !2, file: !3, line: 165, type: !7)
!71 = !DILocation(line: 165, column: 14, scope: !2)
!72 = !DILocalVariable(name: "nxt", scope: !2, file: !3, line: 169, type: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "nextrpc_datatype", file: !74, line: 39, baseType: !75)
!74 = !DIFile(filename: "./partitioned/multithreaded/autogen/codec.h", directory: "/workspaces/build/apps/examples/example2")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nextrpc_datatype", file: !74, line: 34, size: 224, elements: !76)
!76 = !{!77, !81, !82, !83}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "mux", scope: !75, file: !74, line: 35, baseType: !78, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !79, line: 26, baseType: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !15, line: 41, baseType: !34)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !75, file: !74, line: 36, baseType: !78, size: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "typ", scope: !75, file: !74, line: 37, baseType: !78, size: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !75, file: !74, line: 38, baseType: !84, size: 128, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "trailer_datatype", file: !74, line: 24, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_trailer_datatype", file: !74, line: 18, size: 128, elements: !86)
!86 = !{!87, !88, !89, !90, !94}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !85, file: !74, line: 19, baseType: !12, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "rqr", scope: !85, file: !74, line: 20, baseType: !12, size: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !85, file: !74, line: 21, baseType: !12, size: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !85, file: !74, line: 22, baseType: !91, size: 16, offset: 96)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !13, line: 25, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !15, line: 40, baseType: !93)
!93 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !85, file: !74, line: 23, baseType: !91, size: 16, offset: 112)
!95 = !DILocation(line: 169, column: 22, scope: !2)
!96 = !DILocation(line: 169, column: 5, scope: !2)
!97 = !DILocalVariable(name: "okay", scope: !2, file: !3, line: 174, type: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "okay_datatype", file: !74, line: 51, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_okay_datatype", file: !74, line: 48, size: 160, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !99, file: !74, line: 49, baseType: !78, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !99, file: !74, line: 50, baseType: !84, size: 128, offset: 32)
!103 = !DILocation(line: 174, column: 19, scope: !2)
!104 = !DILocation(line: 174, column: 5, scope: !2)
!105 = !DILocation(line: 180, column: 5, scope: !2)
!106 = !DILocation(line: 188, column: 10, scope: !107)
!107 = distinct !DILexicalBlock(scope: !2, file: !3, line: 188, column: 9)
!108 = !DILocation(line: 188, column: 9, scope: !2)
!109 = !DILocation(line: 189, column: 16, scope: !110)
!110 = distinct !DILexicalBlock(scope: !107, file: !3, line: 188, column: 18)
!111 = !DILocation(line: 190, column: 19, scope: !110)
!112 = !DILocation(line: 190, column: 17, scope: !110)
!113 = !DILocation(line: 191, column: 19, scope: !110)
!114 = !DILocation(line: 191, column: 17, scope: !110)
!115 = !DILocation(line: 192, column: 9, scope: !110)
!116 = !DILocation(line: 193, column: 5, scope: !110)
!117 = !DILocation(line: 204, column: 23, scope: !2)
!118 = !DILocation(line: 204, column: 32, scope: !2)
!119 = !DILocation(line: 204, column: 5, scope: !2)
!120 = !DILocation(line: 205, column: 5, scope: !2)
!121 = !DILocation(line: 206, column: 10, scope: !2)
!122 = !DILocation(line: 206, column: 12, scope: !2)
!123 = !DILocation(line: 207, column: 19, scope: !2)
!124 = !DILocation(line: 207, column: 28, scope: !2)
!125 = !DILocation(line: 207, column: 5, scope: !2)
!126 = !DILocation(line: 209, column: 22, scope: !2)
!127 = !DILocation(line: 209, column: 5, scope: !2)
!128 = !DILocation(line: 209, column: 12, scope: !2)
!129 = !DILocation(line: 209, column: 16, scope: !2)
!130 = !DILocation(line: 210, column: 22, scope: !2)
!131 = !DILocation(line: 210, column: 5, scope: !2)
!132 = !DILocation(line: 210, column: 12, scope: !2)
!133 = !DILocation(line: 210, column: 16, scope: !2)
!134 = !DILocation(line: 211, column: 22, scope: !2)
!135 = !DILocation(line: 211, column: 5, scope: !2)
!136 = !DILocation(line: 211, column: 12, scope: !2)
!137 = !DILocation(line: 211, column: 16, scope: !2)
!138 = !DILocation(line: 212, column: 1, scope: !2)
!139 = !DILocalVariable(name: "tag", arg: 1, scope: !33, file: !3, line: 214, type: !6)
!140 = !DILocation(line: 214, column: 41, scope: !33)
!141 = !DILocalVariable(name: "t_tag", scope: !33, file: !3, line: 236, type: !7)
!142 = !DILocation(line: 236, column: 14, scope: !33)
!143 = !DILocalVariable(name: "o_tag", scope: !33, file: !3, line: 237, type: !7)
!144 = !DILocation(line: 237, column: 14, scope: !33)
!145 = !DILocalVariable(name: "req_get_ewma", scope: !33, file: !3, line: 241, type: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_get_ewma_datatype", file: !74, line: 61, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_request_get_ewma_datatype", file: !74, line: 58, size: 192, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !147, file: !74, line: 59, baseType: !43, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !147, file: !74, line: 60, baseType: !84, size: 128, offset: 64)
!151 = !DILocation(line: 241, column: 31, scope: !33)
!152 = !DILocation(line: 241, column: 5, scope: !33)
!153 = !DILocation(line: 247, column: 5, scope: !33)
!154 = !DILocalVariable(name: "res_get_ewma", scope: !33, file: !3, line: 251, type: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "response_get_ewma_datatype", file: !74, line: 71, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_response_get_ewma_datatype", file: !74, line: 68, size: 192, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ret", scope: !156, file: !74, line: 69, baseType: !43, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !156, file: !74, line: 70, baseType: !84, size: 128, offset: 64)
!160 = !DILocation(line: 251, column: 32, scope: !33)
!161 = !DILocation(line: 251, column: 5, scope: !33)
!162 = !DILocation(line: 257, column: 5, scope: !33)
!163 = !DILocation(line: 265, column: 10, scope: !164)
!164 = distinct !DILexicalBlock(scope: !33, file: !3, line: 265, column: 9)
!165 = !DILocation(line: 265, column: 9, scope: !33)
!166 = !DILocation(line: 266, column: 16, scope: !167)
!167 = distinct !DILexicalBlock(scope: !164, file: !3, line: 265, column: 18)
!168 = !DILocation(line: 267, column: 19, scope: !167)
!169 = !DILocation(line: 267, column: 17, scope: !167)
!170 = !DILocation(line: 268, column: 19, scope: !167)
!171 = !DILocation(line: 268, column: 17, scope: !167)
!172 = !DILocation(line: 269, column: 9, scope: !167)
!173 = !DILocation(line: 270, column: 5, scope: !167)
!174 = !DILocation(line: 275, column: 23, scope: !33)
!175 = !DILocation(line: 275, column: 32, scope: !33)
!176 = !DILocation(line: 275, column: 5, scope: !33)
!177 = !DILocalVariable(name: "reqId", scope: !33, file: !3, line: 307, type: !34)
!178 = !DILocation(line: 307, column: 9, scope: !33)
!179 = !DILocation(line: 307, column: 30, scope: !33)
!180 = !DILocation(line: 307, column: 38, scope: !33)
!181 = !DILocation(line: 308, column: 8, scope: !182)
!182 = distinct !DILexicalBlock(scope: !33, file: !3, line: 308, column: 8)
!183 = !DILocation(line: 308, column: 16, scope: !182)
!184 = !DILocation(line: 308, column: 14, scope: !182)
!185 = !DILocation(line: 308, column: 8, scope: !33)
!186 = !DILocalVariable(name: "error", scope: !187, file: !3, line: 309, type: !34)
!187 = distinct !DILexicalBlock(scope: !182, file: !3, line: 308, column: 34)
!188 = !DILocation(line: 309, column: 13, scope: !187)
!189 = !DILocation(line: 310, column: 29, scope: !187)
!190 = !DILocation(line: 310, column: 27, scope: !187)
!191 = !DILocation(line: 311, column: 55, scope: !187)
!192 = !DILocation(line: 311, column: 33, scope: !187)
!193 = !DILocation(line: 311, column: 31, scope: !187)
!194 = !DILocation(line: 312, column: 32, scope: !187)
!195 = !DILocation(line: 312, column: 30, scope: !187)
!196 = !DILocation(line: 313, column: 36, scope: !187)
!197 = !DILocation(line: 313, column: 54, scope: !187)
!198 = !DILocation(line: 313, column: 61, scope: !187)
!199 = !DILocation(line: 313, column: 82, scope: !187)
!200 = !DILocation(line: 313, column: 59, scope: !187)
!201 = !DILocation(line: 313, column: 22, scope: !187)
!202 = !DILocation(line: 313, column: 30, scope: !187)
!203 = !DILocation(line: 313, column: 34, scope: !187)
!204 = !DILocation(line: 314, column: 28, scope: !187)
!205 = !DILocation(line: 314, column: 22, scope: !187)
!206 = !DILocation(line: 314, column: 26, scope: !187)
!207 = !DILocation(line: 316, column: 23, scope: !187)
!208 = !DILocation(line: 316, column: 32, scope: !187)
!209 = !DILocation(line: 316, column: 9, scope: !187)
!210 = !DILocation(line: 318, column: 5, scope: !187)
!211 = !DILocation(line: 319, column: 13, scope: !212)
!212 = distinct !DILexicalBlock(scope: !182, file: !3, line: 319, column: 13)
!213 = !DILocation(line: 319, column: 22, scope: !212)
!214 = !DILocation(line: 319, column: 19, scope: !212)
!215 = !DILocation(line: 319, column: 13, scope: !182)
!216 = !DILocation(line: 319, column: 76, scope: !217)
!217 = distinct !DILexicalBlock(scope: !212, file: !3, line: 319, column: 40)
!218 = !DILocation(line: 319, column: 94, scope: !217)
!219 = !DILocation(line: 319, column: 101, scope: !217)
!220 = !DILocation(line: 319, column: 122, scope: !217)
!221 = !DILocation(line: 319, column: 99, scope: !217)
!222 = !DILocation(line: 319, column: 62, scope: !217)
!223 = !DILocation(line: 319, column: 70, scope: !217)
!224 = !DILocation(line: 319, column: 74, scope: !217)
!225 = !DILocation(line: 320, column: 28, scope: !217)
!226 = !DILocation(line: 320, column: 22, scope: !217)
