; ModuleID = './partitioned/multithreaded/purple/purple_rpc.c'
source_filename = "./partitioned/multithreaded/purple/purple_rpc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._tag = type { i32, i32, i32 }
%struct._nextrpc_datatype = type { i32, i32, i32, %struct._trailer_datatype }
%struct._trailer_datatype = type { i32, i32, i32, i16, i16 }
%struct._okay_datatype = type { i32, %struct._trailer_datatype }
%struct._request_get_ewma_datatype = type { i32, %struct._trailer_datatype }
%struct._response_get_ewma_datatype = type { double, %struct._trailer_datatype }

@_notify_next_tag.inited = internal global i32 0, align 4, !dbg !0
@_notify_next_tag.psocket = internal global i8* null, align 8, !dbg !26
@_notify_next_tag.ssocket = internal global i8* null, align 8, !dbg !29
@.str = private unnamed_addr constant [12 x i8] c"TAG_NEXTRPC\00", section "llvm.metadata"
@.str.1 = private unnamed_addr constant [48 x i8] c"./partitioned/multithreaded/purple/purple_rpc.c\00", section "llvm.metadata"
@.str.2 = private unnamed_addr constant [9 x i8] c"TAG_OKAY\00", section "llvm.metadata"
@.str.3 = private unnamed_addr constant [21 x i8] c"TAG_REQUEST_GET_EWMA\00", section "llvm.metadata"
@.str.4 = private unnamed_addr constant [22 x i8] c"TAG_RESPONSE_GET_EWMA\00", section "llvm.metadata"
@_rpc_get_ewma.inited = internal global i32 0, align 4, !dbg !31

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "inited", scope: !2, file: !3, line: 161, type: !38, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "_notify_next_tag", scope: !3, file: !3, line: 148, type: !4, scopeLine: 148, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !21)
!3 = !DIFile(filename: "./partitioned/multithreaded/purple/purple_rpc.c", directory: "/workspaces/build/apps/examples/example3")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "gaps_tag", file: !8, line: 28, baseType: !9)
!8 = !DIFile(filename: "/opt/closure/include/xdcomms.h", directory: "")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tag", file: !8, line: 24, size: 96, elements: !10)
!10 = !{!11, !17, !18}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "mux", scope: !9, file: !8, line: 25, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 26, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !15, line: 42, baseType: !16)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !9, file: !8, line: 26, baseType: !12, size: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "typ", scope: !9, file: !8, line: 27, baseType: !12, size: 32, offset: 64)
!19 = distinct !DICompileUnit(language: DW_LANG_C99, file: !20, producer: "clang version 10.0.1 (https://github.com/gaps-closure/llvm-project 4954dd8b02af91d5e8d4815824208b6004f667a8)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !22, globals: !25, splitDebugInlining: false, nameTableKind: None)
!20 = !DIFile(filename: "partitioned/multithreaded/purple/purple_rpc.c", directory: "/workspaces/build/apps/examples/example3")
!21 = !{}
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !{!0, !26, !29, !31, !39, !41, !43}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "psocket", scope: !2, file: !3, line: 162, type: !28, isLocal: true, isDefinition: true)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "ssocket", scope: !2, file: !3, line: 163, type: !28, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "inited", scope: !33, file: !3, line: 379, type: !38, isLocal: true, isDefinition: true)
!33 = distinct !DISubprogram(name: "_rpc_get_ewma", scope: !3, file: !3, line: 365, type: !34, scopeLine: 365, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !21)
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !37}
!36 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "psocket", scope: !33, file: !3, line: 380, type: !28, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "ssocket", scope: !33, file: !3, line: 381, type: !28, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "request_counter", scope: !33, file: !3, line: 382, type: !38, isLocal: true, isDefinition: true)
!45 = !{i32 7, !"Dwarf Version", i32 4}
!46 = !{i32 2, !"Debug Info Version", i32 3}
!47 = !{i32 1, !"wchar_size", i32 4}
!48 = !{!"clang version 10.0.1 (https://github.com/gaps-closure/llvm-project 4954dd8b02af91d5e8d4815824208b6004f667a8)"}
!49 = distinct !DISubprogram(name: "_hal_init", scope: !3, file: !3, line: 137, type: !50, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !21)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !23, !23}
!52 = !DILocalVariable(name: "inuri", arg: 1, scope: !49, file: !3, line: 137, type: !23)
!53 = !DILocation(line: 137, column: 22, scope: !49)
!54 = !DILocalVariable(name: "outuri", arg: 2, scope: !49, file: !3, line: 137, type: !23)
!55 = !DILocation(line: 137, column: 35, scope: !49)
!56 = !DILocation(line: 139, column: 16, scope: !49)
!57 = !DILocation(line: 139, column: 5, scope: !49)
!58 = !DILocation(line: 140, column: 17, scope: !49)
!59 = !DILocation(line: 140, column: 5, scope: !49)
!60 = !DILocation(line: 141, column: 5, scope: !49)
!61 = !DILocation(line: 142, column: 5, scope: !49)
!62 = !DILocation(line: 143, column: 5, scope: !49)
!63 = !DILocation(line: 144, column: 5, scope: !49)
!64 = !DILocation(line: 146, column: 1, scope: !49)
!65 = !DILocalVariable(name: "n_tag", arg: 1, scope: !2, file: !3, line: 148, type: !6)
!66 = !DILocation(line: 148, column: 33, scope: !2)
!67 = !DILocalVariable(name: "t_tag", scope: !2, file: !3, line: 164, type: !7)
!68 = !DILocation(line: 164, column: 14, scope: !2)
!69 = !DILocalVariable(name: "o_tag", scope: !2, file: !3, line: 165, type: !7)
!70 = !DILocation(line: 165, column: 14, scope: !2)
!71 = !DILocalVariable(name: "nxt", scope: !2, file: !3, line: 169, type: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "nextrpc_datatype", file: !73, line: 39, baseType: !74)
!73 = !DIFile(filename: "./partitioned/multithreaded/autogen/codec.h", directory: "/workspaces/build/apps/examples/example3")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nextrpc_datatype", file: !73, line: 34, size: 224, elements: !75)
!75 = !{!76, !80, !81, !82}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mux", scope: !74, file: !73, line: 35, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !78, line: 26, baseType: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !15, line: 41, baseType: !38)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !74, file: !73, line: 36, baseType: !77, size: 32, offset: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "typ", scope: !74, file: !73, line: 37, baseType: !77, size: 32, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !74, file: !73, line: 38, baseType: !83, size: 128, offset: 96)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "trailer_datatype", file: !73, line: 24, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_trailer_datatype", file: !73, line: 18, size: 128, elements: !85)
!85 = !{!86, !87, !88, !89, !93}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !84, file: !73, line: 19, baseType: !12, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "rqr", scope: !84, file: !73, line: 20, baseType: !12, size: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !84, file: !73, line: 21, baseType: !12, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !84, file: !73, line: 22, baseType: !90, size: 16, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !13, line: 25, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !15, line: 40, baseType: !92)
!92 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !84, file: !73, line: 23, baseType: !90, size: 16, offset: 112)
!94 = !DILocation(line: 169, column: 22, scope: !2)
!95 = !DILocation(line: 169, column: 5, scope: !2)
!96 = !DILocation(line: 175, column: 5, scope: !2)
!97 = !DILocalVariable(name: "okay", scope: !2, file: !3, line: 179, type: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "okay_datatype", file: !73, line: 51, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_okay_datatype", file: !73, line: 48, size: 160, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !99, file: !73, line: 49, baseType: !77, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !99, file: !73, line: 50, baseType: !83, size: 128, offset: 32)
!103 = !DILocation(line: 179, column: 19, scope: !2)
!104 = !DILocation(line: 179, column: 5, scope: !2)
!105 = !DILocation(line: 185, column: 5, scope: !2)
!106 = !DILocation(line: 193, column: 10, scope: !107)
!107 = distinct !DILexicalBlock(scope: !2, file: !3, line: 193, column: 9)
!108 = !DILocation(line: 193, column: 9, scope: !2)
!109 = !DILocation(line: 194, column: 16, scope: !110)
!110 = distinct !DILexicalBlock(scope: !107, file: !3, line: 193, column: 18)
!111 = !DILocation(line: 195, column: 19, scope: !110)
!112 = !DILocation(line: 195, column: 17, scope: !110)
!113 = !DILocation(line: 196, column: 19, scope: !110)
!114 = !DILocation(line: 196, column: 17, scope: !110)
!115 = !DILocation(line: 197, column: 9, scope: !110)
!116 = !DILocation(line: 198, column: 5, scope: !110)
!117 = !DILocation(line: 200, column: 15, scope: !2)
!118 = !DILocation(line: 200, column: 22, scope: !2)
!119 = !DILocation(line: 200, column: 9, scope: !2)
!120 = !DILocation(line: 200, column: 13, scope: !2)
!121 = !DILocation(line: 201, column: 15, scope: !2)
!122 = !DILocation(line: 201, column: 22, scope: !2)
!123 = !DILocation(line: 201, column: 9, scope: !2)
!124 = !DILocation(line: 201, column: 13, scope: !2)
!125 = !DILocation(line: 202, column: 15, scope: !2)
!126 = !DILocation(line: 202, column: 22, scope: !2)
!127 = !DILocation(line: 202, column: 9, scope: !2)
!128 = !DILocation(line: 202, column: 13, scope: !2)
!129 = !DILocation(line: 210, column: 19, scope: !2)
!130 = !DILocation(line: 210, column: 28, scope: !2)
!131 = !DILocation(line: 210, column: 5, scope: !2)
!132 = !DILocation(line: 211, column: 23, scope: !2)
!133 = !DILocation(line: 211, column: 32, scope: !2)
!134 = !DILocation(line: 211, column: 5, scope: !2)
!135 = !DILocation(line: 214, column: 1, scope: !2)
!136 = distinct !DISubprogram(name: "_rpc_get_ewma_sync_request_counter", scope: !3, file: !3, line: 291, type: !137, scopeLine: 291, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !21)
!137 = !DISubroutineType(types: !138)
!138 = !{!38, !37, !28, !28, !6, !6}
!139 = !DILocalVariable(name: "request_counter", arg: 1, scope: !136, file: !3, line: 291, type: !37)
!140 = !DILocation(line: 291, column: 45, scope: !136)
!141 = !DILocalVariable(name: "psocket", arg: 2, scope: !136, file: !3, line: 291, type: !28)
!142 = !DILocation(line: 291, column: 68, scope: !136)
!143 = !DILocalVariable(name: "ssocket", arg: 3, scope: !136, file: !3, line: 291, type: !28)
!144 = !DILocation(line: 291, column: 83, scope: !136)
!145 = !DILocalVariable(name: "t_tag", arg: 4, scope: !136, file: !3, line: 291, type: !6)
!146 = !DILocation(line: 291, column: 102, scope: !136)
!147 = !DILocalVariable(name: "o_tag", arg: 5, scope: !136, file: !3, line: 291, type: !6)
!148 = !DILocation(line: 291, column: 119, scope: !136)
!149 = !DILocalVariable(name: "tries_remaining", scope: !136, file: !3, line: 292, type: !38)
!150 = !DILocation(line: 292, column: 9, scope: !136)
!151 = !DILocation(line: 293, column: 5, scope: !136)
!152 = !DILocation(line: 293, column: 11, scope: !136)
!153 = !DILocation(line: 293, column: 27, scope: !136)
!154 = !DILocalVariable(name: "req_get_ewma", scope: !155, file: !3, line: 296, type: !156)
!155 = distinct !DILexicalBlock(scope: !136, file: !3, line: 293, column: 32)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_get_ewma_datatype", file: !73, line: 61, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_request_get_ewma_datatype", file: !73, line: 58, size: 160, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !157, file: !73, line: 59, baseType: !77, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !157, file: !73, line: 60, baseType: !83, size: 128, offset: 32)
!161 = !DILocation(line: 296, column: 35, scope: !155)
!162 = !DILocation(line: 296, column: 9, scope: !155)
!163 = !DILocalVariable(name: "res_get_ewma", scope: !155, file: !3, line: 302, type: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "response_get_ewma_datatype", file: !73, line: 71, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_response_get_ewma_datatype", file: !73, line: 68, size: 192, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ret", scope: !165, file: !73, line: 69, baseType: !36, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !165, file: !73, line: 70, baseType: !83, size: 128, offset: 64)
!169 = !DILocation(line: 302, column: 36, scope: !155)
!170 = !DILocation(line: 302, column: 9, scope: !155)
!171 = !DILocation(line: 306, column: 22, scope: !155)
!172 = !DILocation(line: 306, column: 28, scope: !155)
!173 = !DILocation(line: 307, column: 37, scope: !155)
!174 = !DILocation(line: 307, column: 36, scope: !155)
!175 = !DILocation(line: 307, column: 22, scope: !155)
!176 = !DILocation(line: 307, column: 30, scope: !155)
!177 = !DILocation(line: 307, column: 34, scope: !155)
!178 = !DILocation(line: 308, column: 23, scope: !155)
!179 = !DILocation(line: 308, column: 32, scope: !155)
!180 = !DILocation(line: 308, column: 47, scope: !155)
!181 = !DILocation(line: 308, column: 9, scope: !155)
!182 = !DILocalVariable(name: "status", scope: !155, file: !3, line: 310, type: !38)
!183 = !DILocation(line: 310, column: 13, scope: !155)
!184 = !DILocation(line: 310, column: 31, scope: !155)
!185 = !DILocation(line: 310, column: 40, scope: !155)
!186 = !DILocation(line: 310, column: 55, scope: !155)
!187 = !DILocation(line: 310, column: 22, scope: !155)
!188 = !DILocalVariable(name: "respId", scope: !155, file: !3, line: 312, type: !38)
!189 = !DILocation(line: 312, column: 13, scope: !155)
!190 = !DILocation(line: 312, column: 35, scope: !155)
!191 = !DILocation(line: 312, column: 43, scope: !155)
!192 = !DILocation(line: 312, column: 47, scope: !155)
!193 = !DILocalVariable(name: "error", scope: !155, file: !3, line: 313, type: !38)
!194 = !DILocation(line: 313, column: 13, scope: !155)
!195 = !DILocation(line: 313, column: 35, scope: !155)
!196 = !DILocation(line: 313, column: 43, scope: !155)
!197 = !DILocation(line: 313, column: 47, scope: !155)
!198 = !DILocation(line: 313, column: 52, scope: !155)
!199 = !DILocation(line: 314, column: 12, scope: !200)
!200 = distinct !DILexicalBlock(scope: !155, file: !3, line: 314, column: 12)
!201 = !DILocation(line: 314, column: 19, scope: !200)
!202 = !DILocation(line: 314, column: 12, scope: !155)
!203 = !DILocation(line: 315, column: 28, scope: !204)
!204 = distinct !DILexicalBlock(scope: !200, file: !3, line: 314, column: 25)
!205 = !DILocation(line: 316, column: 9, scope: !204)
!206 = !DILocation(line: 318, column: 32, scope: !207)
!207 = distinct !DILexicalBlock(scope: !200, file: !3, line: 317, column: 13)
!208 = !DILocation(line: 318, column: 14, scope: !207)
!209 = !DILocation(line: 318, column: 30, scope: !207)
!210 = !DILocation(line: 319, column: 13, scope: !207)
!211 = distinct !{!211, !151, !212}
!212 = !DILocation(line: 321, column: 5, scope: !136)
!213 = !DILocation(line: 322, column: 5, scope: !136)
!214 = !DILocation(line: 323, column: 1, scope: !136)
!215 = distinct !DISubprogram(name: "_rpc_get_ewma_remote_call", scope: !3, file: !3, line: 325, type: !216, scopeLine: 325, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !21)
!216 = !DISubroutineType(types: !217)
!217 = !{!38, !38, !218, !28, !28, !6, !6}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!219 = !DILocalVariable(name: "reqId", arg: 1, scope: !215, file: !3, line: 325, type: !38)
!220 = !DILocation(line: 325, column: 35, scope: !215)
!221 = !DILocalVariable(name: "result", arg: 2, scope: !215, file: !3, line: 325, type: !218)
!222 = !DILocation(line: 325, column: 50, scope: !215)
!223 = !DILocalVariable(name: "psocket", arg: 3, scope: !215, file: !3, line: 325, type: !28)
!224 = !DILocation(line: 325, column: 64, scope: !215)
!225 = !DILocalVariable(name: "ssocket", arg: 4, scope: !215, file: !3, line: 325, type: !28)
!226 = !DILocation(line: 325, column: 79, scope: !215)
!227 = !DILocalVariable(name: "t_tag", arg: 5, scope: !215, file: !3, line: 325, type: !6)
!228 = !DILocation(line: 325, column: 98, scope: !215)
!229 = !DILocalVariable(name: "o_tag", arg: 6, scope: !215, file: !3, line: 325, type: !6)
