; ModuleID = './partitioned/multithreaded/purple/purple_rpc.c'
source_filename = "./partitioned/multithreaded/purple/purple_rpc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._tag = type { i32, i32, i32 }
%struct._nextrpc_datatype = type { i32, i32, i32, %struct._trailer_datatype }
%struct._trailer_datatype = type { i32, i32, i32, i16, i16 }
%struct._okay_datatype = type { i32, %struct._trailer_datatype }
%struct._request_get_a_datatype = type { i32, %struct._trailer_datatype }
%struct._response_get_a_datatype = type { double, %struct._trailer_datatype }

@_notify_next_tag.inited = internal global i32 0, align 4, !dbg !0
@_notify_next_tag.psocket = internal global i8* null, align 8, !dbg !31
@_notify_next_tag.ssocket = internal global i8* null, align 8, !dbg !34
@.str = private unnamed_addr constant [12 x i8] c"TAG_NEXTRPC\00", section "llvm.metadata"
@.str.1 = private unnamed_addr constant [48 x i8] c"./partitioned/multithreaded/purple/purple_rpc.c\00", section "llvm.metadata"
@.str.2 = private unnamed_addr constant [9 x i8] c"TAG_OKAY\00", section "llvm.metadata"
@.str.3 = private unnamed_addr constant [18 x i8] c"TAG_REQUEST_GET_A\00", section "llvm.metadata"
@.str.4 = private unnamed_addr constant [19 x i8] c"TAG_RESPONSE_GET_A\00", section "llvm.metadata"
@_rpc_get_a.inited = internal global i32 0, align 4, !dbg !36

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "inited", scope: !2, file: !3, line: 130, type: !43, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "_notify_next_tag", scope: !3, file: !3, line: 117, type: !4, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !44)
!3 = !DIFile(filename: "./partitioned/multithreaded/purple/purple_rpc.c", directory: "/workspaces/build/apps/examples/example1")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "gaps_tag", file: !8, line: 28, baseType: !9)
!8 = !DIFile(filename: "/opt/closure/include/xdcomms.h", directory: "")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tag", file: !8, line: 24, size: 96, elements: !10)
!10 = !{!11, !17, !18}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "mux", scope: !9, file: !8, line: 25, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 26, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !15, line: 42, baseType: !16)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !9, file: !8, line: 26, baseType: !12, size: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "typ", scope: !9, file: !8, line: 27, baseType: !12, size: 32, offset: 64)
!19 = distinct !DICompileUnit(language: DW_LANG_C99, file: !20, producer: "clang version 10.0.1 (https://github.com/gaps-closure/llvm-project 4954dd8b02af91d5e8d4815824208b6004f667a8)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !21, retainedTypes: !27, globals: !30, splitDebugInlining: false, nameTableKind: None)
!20 = !DIFile(filename: "partitioned/multithreaded/purple/purple_rpc.c", directory: "/workspaces/build/apps/examples/example1")
!21 = !{!22}
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATUS", file: !3, line: 186, baseType: !16, size: 32, elements: !23)
!23 = !{!24, !25, !26}
!24 = !DIEnumerator(name: "FAILED", value: 0, isUnsigned: true)
!25 = !DIEnumerator(name: "OK", value: 1, isUnsigned: true)
!26 = !DIEnumerator(name: "RESTARTED", value: 2, isUnsigned: true)
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!30 = !{!0, !31, !34, !36, !45, !47, !49}
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "psocket", scope: !2, file: !3, line: 131, type: !33, isLocal: true, isDefinition: true)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "ssocket", scope: !2, file: !3, line: 132, type: !33, isLocal: true, isDefinition: true)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "inited", scope: !38, file: !3, line: 279, type: !43, isLocal: true, isDefinition: true)
!38 = distinct !DISubprogram(name: "_rpc_get_a", scope: !3, file: !3, line: 266, type: !39, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !44)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !42, !42}
!41 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!44 = !{}
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "psocket", scope: !38, file: !3, line: 280, type: !33, isLocal: true, isDefinition: true)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "ssocket", scope: !38, file: !3, line: 281, type: !33, isLocal: true, isDefinition: true)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "request_counter", scope: !38, file: !3, line: 282, type: !43, isLocal: true, isDefinition: true)
!51 = !{i32 7, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{i32 1, !"wchar_size", i32 4}
!54 = !{!"clang version 10.0.1 (https://github.com/gaps-closure/llvm-project 4954dd8b02af91d5e8d4815824208b6004f667a8)"}
!55 = distinct !DISubprogram(name: "_hal_init", scope: !3, file: !3, line: 106, type: !56, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !44)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !28, !28}
!58 = !DILocalVariable(name: "inuri", arg: 1, scope: !55, file: !3, line: 106, type: !28)
!59 = !DILocation(line: 106, column: 22, scope: !55)
!60 = !DILocalVariable(name: "outuri", arg: 2, scope: !55, file: !3, line: 106, type: !28)
!61 = !DILocation(line: 106, column: 35, scope: !55)
!62 = !DILocation(line: 108, column: 16, scope: !55)
!63 = !DILocation(line: 108, column: 5, scope: !55)
!64 = !DILocation(line: 109, column: 17, scope: !55)
!65 = !DILocation(line: 109, column: 5, scope: !55)
!66 = !DILocation(line: 110, column: 5, scope: !55)
!67 = !DILocation(line: 111, column: 5, scope: !55)
!68 = !DILocation(line: 112, column: 5, scope: !55)
!69 = !DILocation(line: 113, column: 5, scope: !55)
!70 = !DILocation(line: 115, column: 1, scope: !55)
!71 = !DILocalVariable(name: "n_tag", arg: 1, scope: !2, file: !3, line: 117, type: !6)
!72 = !DILocation(line: 117, column: 33, scope: !2)
!73 = !DILocalVariable(name: "t_tag", scope: !2, file: !3, line: 133, type: !7)
!74 = !DILocation(line: 133, column: 14, scope: !2)
!75 = !DILocalVariable(name: "o_tag", scope: !2, file: !3, line: 134, type: !7)
!76 = !DILocation(line: 134, column: 14, scope: !2)
!77 = !DILocalVariable(name: "nxt", scope: !2, file: !3, line: 138, type: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "nextrpc_datatype", file: !79, line: 39, baseType: !80)
!79 = !DIFile(filename: "./partitioned/multithreaded/autogen/codec.h", directory: "/workspaces/build/apps/examples/example1")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nextrpc_datatype", file: !79, line: 34, size: 224, elements: !81)
!81 = !{!82, !86, !87, !88}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mux", scope: !80, file: !79, line: 35, baseType: !83, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !84, line: 26, baseType: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !15, line: 41, baseType: !43)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "sec", scope: !80, file: !79, line: 36, baseType: !83, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "typ", scope: !80, file: !79, line: 37, baseType: !83, size: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !80, file: !79, line: 38, baseType: !89, size: 128, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "trailer_datatype", file: !79, line: 24, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_trailer_datatype", file: !79, line: 18, size: 128, elements: !91)
!91 = !{!92, !93, !94, !95, !99}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !90, file: !79, line: 19, baseType: !12, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "rqr", scope: !90, file: !79, line: 20, baseType: !12, size: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !90, file: !79, line: 21, baseType: !12, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !90, file: !79, line: 22, baseType: !96, size: 16, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !13, line: 25, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !15, line: 40, baseType: !98)
!98 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !90, file: !79, line: 23, baseType: !96, size: 16, offset: 112)
!100 = !DILocation(line: 138, column: 22, scope: !2)
!101 = !DILocation(line: 138, column: 5, scope: !2)
!102 = !DILocation(line: 144, column: 5, scope: !2)
!103 = !DILocalVariable(name: "okay", scope: !2, file: !3, line: 148, type: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "okay_datatype", file: !79, line: 51, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_okay_datatype", file: !79, line: 48, size: 160, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !105, file: !79, line: 49, baseType: !83, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !105, file: !79, line: 50, baseType: !89, size: 128, offset: 32)
!109 = !DILocation(line: 148, column: 19, scope: !2)
!110 = !DILocation(line: 148, column: 5, scope: !2)
!111 = !DILocation(line: 154, column: 5, scope: !2)
!112 = !DILocation(line: 162, column: 10, scope: !113)
!113 = distinct !DILexicalBlock(scope: !2, file: !3, line: 162, column: 9)
!114 = !DILocation(line: 162, column: 9, scope: !2)
!115 = !DILocation(line: 163, column: 16, scope: !116)
!116 = distinct !DILexicalBlock(scope: !113, file: !3, line: 162, column: 18)
!117 = !DILocation(line: 164, column: 19, scope: !116)
!118 = !DILocation(line: 164, column: 17, scope: !116)
!119 = !DILocation(line: 165, column: 19, scope: !116)
!120 = !DILocation(line: 165, column: 17, scope: !116)
!121 = !DILocation(line: 166, column: 9, scope: !116)
!122 = !DILocation(line: 167, column: 5, scope: !116)
!123 = !DILocation(line: 169, column: 15, scope: !2)
!124 = !DILocation(line: 169, column: 22, scope: !2)
!125 = !DILocation(line: 169, column: 9, scope: !2)
!126 = !DILocation(line: 169, column: 13, scope: !2)
!127 = !DILocation(line: 170, column: 15, scope: !2)
!128 = !DILocation(line: 170, column: 22, scope: !2)
!129 = !DILocation(line: 170, column: 9, scope: !2)
!130 = !DILocation(line: 170, column: 13, scope: !2)
!131 = !DILocation(line: 171, column: 15, scope: !2)
!132 = !DILocation(line: 171, column: 22, scope: !2)
!133 = !DILocation(line: 171, column: 9, scope: !2)
!134 = !DILocation(line: 171, column: 13, scope: !2)
!135 = !DILocation(line: 179, column: 19, scope: !2)
!136 = !DILocation(line: 179, column: 28, scope: !2)
!137 = !DILocation(line: 179, column: 5, scope: !2)
!138 = !DILocation(line: 180, column: 23, scope: !2)
!139 = !DILocation(line: 180, column: 32, scope: !2)
!140 = !DILocation(line: 180, column: 5, scope: !2)
!141 = !DILocation(line: 183, column: 1, scope: !2)
!142 = distinct !DISubprogram(name: "_rpc_get_a_sync_request_counter", scope: !3, file: !3, line: 191, type: !143, scopeLine: 191, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !44)
!143 = !DISubroutineType(types: !144)
!144 = !{!22, !42, !33, !33, !6, !6}
!145 = !DILocalVariable(name: "request_counter", arg: 1, scope: !142, file: !3, line: 191, type: !42)
!146 = !DILocation(line: 191, column: 50, scope: !142)
!147 = !DILocalVariable(name: "psocket", arg: 2, scope: !142, file: !3, line: 191, type: !33)
!148 = !DILocation(line: 191, column: 73, scope: !142)
!149 = !DILocalVariable(name: "ssocket", arg: 3, scope: !142, file: !3, line: 191, type: !33)
!150 = !DILocation(line: 191, column: 88, scope: !142)
!151 = !DILocalVariable(name: "t_tag", arg: 4, scope: !142, file: !3, line: 191, type: !6)
!152 = !DILocation(line: 191, column: 107, scope: !142)
!153 = !DILocalVariable(name: "o_tag", arg: 5, scope: !142, file: !3, line: 191, type: !6)
!154 = !DILocation(line: 191, column: 124, scope: !142)
!155 = !DILocalVariable(name: "tries_remaining", scope: !142, file: !3, line: 192, type: !43)
!156 = !DILocation(line: 192, column: 9, scope: !142)
!157 = !DILocation(line: 193, column: 5, scope: !142)
!158 = !DILocation(line: 193, column: 11, scope: !142)
!159 = !DILocation(line: 193, column: 27, scope: !142)
!160 = !DILocalVariable(name: "req_get_a", scope: !161, file: !3, line: 196, type: !162)
!161 = distinct !DILexicalBlock(scope: !142, file: !3, line: 193, column: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "request_get_a_datatype", file: !79, line: 61, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_request_get_a_datatype", file: !79, line: 58, size: 160, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !163, file: !79, line: 59, baseType: !83, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !163, file: !79, line: 60, baseType: !89, size: 128, offset: 32)
!167 = !DILocation(line: 196, column: 32, scope: !161)
!168 = !DILocation(line: 196, column: 9, scope: !161)
!169 = !DILocalVariable(name: "res_get_a", scope: !161, file: !3, line: 202, type: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "response_get_a_datatype", file: !79, line: 71, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_response_get_a_datatype", file: !79, line: 68, size: 192, elements: !172)
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ret", scope: !171, file: !79, line: 69, baseType: !41, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "trailer", scope: !171, file: !79, line: 70, baseType: !89, size: 128, offset: 64)
!175 = !DILocation(line: 202, column: 33, scope: !161)
!176 = !DILocation(line: 202, column: 9, scope: !161)
!177 = !DILocation(line: 206, column: 19, scope: !161)
!178 = !DILocation(line: 206, column: 25, scope: !161)
!179 = !DILocation(line: 207, column: 34, scope: !161)
!180 = !DILocation(line: 207, column: 33, scope: !161)
!181 = !DILocation(line: 207, column: 19, scope: !161)
!182 = !DILocation(line: 207, column: 27, scope: !161)
!183 = !DILocation(line: 207, column: 31, scope: !161)
!184 = !DILocation(line: 208, column: 23, scope: !161)
!185 = !DILocation(line: 208, column: 32, scope: !161)
!186 = !DILocation(line: 208, column: 44, scope: !161)
!187 = !DILocation(line: 208, column: 9, scope: !161)
!188 = !DILocalVariable(name: "status", scope: !161, file: !3, line: 209, type: !43)
!189 = !DILocation(line: 209, column: 13, scope: !161)
!190 = !DILocation(line: 209, column: 31, scope: !161)
!191 = !DILocation(line: 209, column: 40, scope: !161)
!192 = !DILocation(line: 209, column: 52, scope: !161)
!193 = !DILocation(line: 209, column: 22, scope: !161)
!194 = !DILocalVariable(name: "respId", scope: !161, file: !3, line: 210, type: !43)
!195 = !DILocation(line: 210, column: 13, scope: !161)
!196 = !DILocation(line: 210, column: 32, scope: !161)
!197 = !DILocation(line: 210, column: 40, scope: !161)
!198 = !DILocation(line: 210, column: 44, scope: !161)
!199 = !DILocalVariable(name: "error", scope: !161, file: !3, line: 211, type: !200)
!200 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!201 = !DILocation(line: 211, column: 14, scope: !161)
!202 = !DILocation(line: 211, column: 33, scope: !161)
!203 = !DILocation(line: 211, column: 41, scope: !161)
!204 = !DILocation(line: 211, column: 45, scope: !161)
!205 = !DILocation(line: 211, column: 50, scope: !161)
!206 = !DILocation(line: 211, column: 22, scope: !161)
!207 = !DILocalVariable(name: "callee_restarted", scope: !161, file: !3, line: 212, type: !200)
!208 = !DILocation(line: 212, column: 14, scope: !161)
!209 = !DILocation(line: 212, column: 43, scope: !161)
!210 = !DILocation(line: 212, column: 51, scope: !161)
!211 = !DILocation(line: 212, column: 55, scope: !161)
!212 = !DILocation(line: 212, column: 33, scope: !161)
!213 = !DILocation(line: 213, column: 12, scope: !214)
!214 = distinct !DILexicalBlock(scope: !161, file: !3, line: 213, column: 12)
!215 = !DILocation(line: 213, column: 19, scope: !214)
!216 = !DILocation(line: 213, column: 12, scope: !161)
!217 = !DILocation(line: 214, column: 28, scope: !218)
!218 = distinct !DILexicalBlock(scope: !214, file: !3, line: 213, column: 30)
!219 = !DILocation(line: 215, column: 9, scope: !218)
!220 = !DILocation(line: 217, column: 32, scope: !221)
!221 = distinct !DILexicalBlock(scope: !214, file: !3, line: 216, column: 13)
!222 = !DILocation(line: 217, column: 14, scope: !221)
!223 = !DILocation(line: 217, column: 30, scope: !221)
!224 = !DILocation(line: 218, column: 13, scope: !221)
!225 = distinct !{!225, !157, !226}
!226 = !DILocation(line: 220, column: 5, scope: !142)
!227 = !DILocation(line: 221, column: 5, scope: !142)
!228 = !DILocation(line: 222, column: 1, scope: !142)
!229 = distinct !DISubprogram(name: "_rpc_get_a_remote_call", scope: !3, file: !3, line: 224, type: !230, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !44)
!230 = !DISubroutineType(types: !231)
!231 = !{!22, !43, !232, !33, !33, !6, !6}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!233 = !DILocalVariable(name: "reqId", arg: 1, scope: !229, file: !3, line: 224, type: !43)
!234 = !DILocation(line: 224, column: 40, scope: !229)
!235 = !DILocalVariable(name: "result", arg: 2, scope: !229, file: !3, line: 224, type: !232)
!236 = !DILocation(line: 224, column: 55, scope: !229)
